//Технологична училище електронни системи към ТУ -София http://www.elsys-bg.org/

// 11 А

// 20

//Николай Василев Станев

//    Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +?) завършващо на x и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в интервала [0;  +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +?) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
#include <stdlib.h>
#include <iostream>
#include <stdio.h>

using namespace std;

main()
{
      int x,n,z,a=0,b=1,count=0;
      int array_[10];
      
      cout <<"Vuvedete broi izvejdaniq :\n";
      cin >> n;
      cout << "Vuvedete X :\n";
      cin >> x;
      if (x>10)
      {
         cout << "vuvedi x otnovo 0<x<10 !!!\n" ;
         cin >>x;   
      }
      do{
         z=a+b;
         a=b;
         b=z;
         if (z%10 == x)
         {
            array_[count] = z;
            count=count+1;
         } 
       } while(count<=1000);
       for(count=0; count<n; count++)
                cout << array_[count] << endl;
      
      system("PAUSE");    
      return 0;
}
